In [199]:
#Defendencies
import pandas as pd

In [200]:
df= pd.read_csv("Resource/Billionaires.csv")

In [201]:
df.head()

,Rank,Name,Net Worth,Age,Country | Territory,Source,Industry
0,1,Bernard Arnault & family,$211 B,74.0,France,LVMH,Fashion & Retail
1,2,Elon Musk,$180 B,51.0,United States,"Tesla, SpaceX",Automotive
2,3,Jeff Bezos,$114 B,59.0,United States,Amazon,Technology
3,4,Larry Ellison,$107 B,78.0,United States,Oracle,Technology
4,5,Warren Buffett,$106 B,92.0,United States,Berkshire Hathaway,Finance & Investments

In [202]:
df.shape

(2640, 7)

In [203]:
df["Net Worth(In Billions)"] = df["Net Worth"].str.replace("$", "").str.replace(" B", "").astype(float)

In [204]:
df.head()

,Rank,Name,Net Worth,Age,Country | Territory,Source,Industry,Net Worth(In Billions)
0,1,Bernard Arnault & family,$211 B,74.0,France,LVMH,Fashion & Retail,211.0
1,2,Elon Musk,$180 B,51.0,United States,"Tesla, SpaceX",Automotive,180.0
2,3,Jeff Bezos,$114 B,59.0,United States,Amazon,Technology,114.0
3,4,Larry Ellison,$107 B,78.0,United States,Oracle,Technology,107.0
4,5,Warren Buffett,$106 B,92.0,United States,Berkshire Hathaway,Finance & Investments,106.0

In [205]:
same_rank  = df[df["Rank"] == 72]
same_rank

,Rank,Name,Net Worth,Age,Country | Territory,Source,Industry,Net Worth(In Billions)
71,72,Abigail Johnson,$21.6 B,61.0,United States,Fidelity,Finance & Investments,21.6
72,72,Leonid Mikhelson & family,$21.6 B,67.0,Russia,"Gas, chemicals",Energy,21.6

In [206]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2640 entries, 0 to 2639
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    2640 non-null   int64
 1   Name                    2640 non-null   object
 2   Net Worth               2640 non-null   object
 3   Age                     2576 non-null   float64
 4   Country | Territory     2640 non-null   object
 5   Source                  2640 non-null   object
 6   Industry                2640 non-null   object
 7   Net Worth(In Billions)  2640 non-null   float64
dtypes: float64(2), int64(1), object(5)
memory usage: 165.1+ KB

In [207]:
df.isna().sum()

Rank                       0
Name                       0
Net Worth                  0
Age                       64
Country | Territory        0
Source                     0
Industry                   0
Net Worth(In Billions)     0
dtype: int64

In [208]:
df.describe()

              Rank          Age  Net Worth(In Billions)
count  2640.000000  2576.000000             2640.000000
mean   1289.159091    65.134705                4.623788
std     739.693726    13.258245                9.834241
min       1.000000    18.000000                1.000000
25%     659.000000    56.000000                1.500000
50%    1312.000000    65.000000                2.300000
75%    1905.000000    75.000000                4.200000
max    2540.000000   101.000000              211.000000

In [209]:
# imputation method: Treating nulls in "Age" column with median value wiz 65
median_age = df["Age"].median()
df["Age"].fillna(median_age, inplace=True)

In [210]:
df.isna().sum()

Rank                      0
Name                      0
Net Worth                 0
Age                       0
Country | Territory       0
Source                    0
Industry                  0
Net Worth(In Billions)    0
dtype: int64

In [211]:
df["Country | Territory"].value_counts()

Country | Territory
United States           734
China                   490
India                   169
Germany                 126
Russia                  104
                       ...
Belize                    1
Eswatini (Swaziland)      1
Venezuela                 1
Algeria                   1
Panama                    1
Name: count, Length: 77, dtype: int64

In [212]:
df.rename(columns={'Country | Territory': 'Country'}, inplace=True)

In [213]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2640 entries, 0 to 2639
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    2640 non-null   int64
 1   Name                    2640 non-null   object
 2   Net Worth               2640 non-null   object
 3   Age                     2640 non-null   float64
 4   Country                 2640 non-null   object
 5   Source                  2640 non-null   object
 6   Industry                2640 non-null   object
 7   Net Worth(In Billions)  2640 non-null   float64
dtypes: float64(2), int64(1), object(5)
memory usage: 165.1+ KB

In [214]:
industries  = df['Industry'].unique()
industries

array(['Fashion & Retail', 'Automotive', 'Technology',
       'Finance & Investments', 'Media & Entertainment', 'Telecom',
       'Diversified', 'Food & Beverage', 'Logistics',
       'Gambling & Casinos', 'Manufacturing', 'Real Estate',
       'Metals & Mining', 'Energy', 'Healthcare', 'Service',
       'Construction & Engineering', 'Sports'], dtype=object)

In [215]:
len(industries)

18

In [216]:
import numpy as np
industry_ids = np.arange(1, (len(industries))+1)

In [217]:
Industry_ids = [id for id in industry_ids]

Industry_df = pd.DataFrame()
Industry_df['Industry_id'] = Industry_ids
Industry_df['Industry'] =  industries
Industry_df

    Industry_id                    Industry
0             1            Fashion & Retail
1             2                  Automotive
2             3                  Technology
3             4       Finance & Investments
4             5       Media & Entertainment
5             6                     Telecom
6             7                 Diversified
7             8             Food & Beverage
8             9                   Logistics
9            10          Gambling & Casinos
10           11               Manufacturing
11           12                 Real Estate
12           13             Metals & Mining
13           14                      Energy
14           15                  Healthcare
15           16                     Service
16           17  Construction & Engineering
17           18                      Sports

In [218]:
Industry_df.to_csv("ETL/Industry.csv", index=False)

In [219]:
merged_df = df.merge(Industry_df, how='inner', on='Industry')

In [220]:
merged_df.head(150)

,Rank,Name,Net Worth,Age,Country,Source,Industry,Net Worth(In Billions),Industry_id
0,1,Bernard Arnault & family,$211 B,74.0,France,LVMH,Fashion & Retail,211.0,1
1,11,Francoise Bettencourt Meyers & family,$80.5 B,69.0,France,L'Oréal,Fashion & Retail,80.5,1
2,13,Amancio Ortega,$77.3 B,87.0,Spain,Zara,Fashion & Retail,77.3,1
3,19,Jim Walton,$58.8 B,74.0,United States,Walmart,Fashion & Retail,58.8,1
4,20,Rob Walton & family,$57.6 B,78.0,United States,Walmart,Fashion & Retail,57.6,1
...,...,...,...,...,...,...,...,...,...
145,1312,Mi Enhua,$2.3 B,65.0,China,Retail,Fashion & Retail,2.3,1
146,1312,David Nahmad,$2.3 B,75.0,Monaco,Art collection,Fashion & Retail,2.3,1
147,1312,Alberto Prada,$2.3 B,69.0,Italy,Luxury goods,Fashion & Retail,2.3,1
148,1312,Marina Prada,$2.3 B,77.0,Italy,Luxury goods,Fashion & Retail,2.3,1
149,1312,Tang Yiu,$2.3 B,89.0,Hong Kong,Fashion retail,Fashion & Retail,2.3,1

In [221]:
merged_df.reset_index(inplace=True)
merged_df.rename(columns={'index': 'Billionaire_ID'}, inplace=True)

In [222]:
merged_df["Age"] = merged_df["Age"].astype(int)

In [223]:
merged_df.head()

,Billionaire_ID,Rank,Name,Net Worth,Age,Country,Source,Industry,Net Worth(In Billions),Industry_id
0,0,1,Bernard Arnault & family,$211 B,74,France,LVMH,Fashion & Retail,211.0,1
1,1,11,Francoise Bettencourt Meyers & family,$80.5 B,69,France,L'Oréal,Fashion & Retail,80.5,1
2,2,13,Amancio Ortega,$77.3 B,87,Spain,Zara,Fashion & Retail,77.3,1
3,3,19,Jim Walton,$58.8 B,74,United States,Walmart,Fashion & Retail,58.8,1
4,4,20,Rob Walton & family,$57.6 B,78,United States,Walmart,Fashion & Retail,57.6,1

In [224]:
final_df = merged_df.drop(columns= {'Industry'})
final_df.head()

,Billionaire_ID,Rank,Name,Net Worth,Age,Country,Source,Net Worth(In Billions),Industry_id
0,0,1,Bernard Arnault & family,$211 B,74,France,LVMH,211.0,1
1,1,11,Francoise Bettencourt Meyers & family,$80.5 B,69,France,L'Oréal,80.5,1
2,2,13,Amancio Ortega,$77.3 B,87,Spain,Zara,77.3,1
3,3,19,Jim Walton,$58.8 B,74,United States,Walmart,58.8,1
4,4,20,Rob Walton & family,$57.6 B,78,United States,Walmart,57.6,1

In [225]:
final_df.rename(columns={'Net Worth(In Billions)': 'Net_Worth_B'}, inplace=True)
final_df.head()

,Billionaire_ID,Rank,Name,Net Worth,Age,Country,Source,Net_Worth_B,Industry_id
0,0,1,Bernard Arnault & family,$211 B,74,France,LVMH,211.0,1
1,1,11,Francoise Bettencourt Meyers & family,$80.5 B,69,France,L'Oréal,80.5,1
2,2,13,Amancio Ortega,$77.3 B,87,Spain,Zara,77.3,1
3,3,19,Jim Walton,$58.8 B,74,United States,Walmart,58.8,1
4,4,20,Rob Walton & family,$57.6 B,78,United States,Walmart,57.6,1

In [226]:
final_df.to_csv("ETL/Billionaires.csv", index=False)

In [227]:
# final_df["Age"].astype(f)

In [228]:
final_df.dtypes

Billionaire_ID      int64
Rank                int64
Name               object
Net Worth          object
Age                 int32
Country            object
Source             object
Net_Worth_B       float64
Industry_id         int32
dtype: object

## Coverting CSV to JSON

In [224]:
json_data = df.to_json(orient='records')

#Export JSON Data to a file
with open('Billionaires.json', 'w') as f:
    f.write(json_data)